app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "testtesttesttest"], ["body", "testtesttesttest"], ["created_at", "2020-01-12 16:55:49.131915"], ["updated_at", "2020-01-12 16:55:49.131915"]]
---
	def create
		#render plain: params[:post].inspect
		@post = Post.new(post_params)
		if (@post.save)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "testtesttesttest\"><img src=x onerror=prompt(1)>"], ["body", "testtesttesttest\"><img src=x onerror=prompt(1)>"], ["updated_at", "2020-01-12 16:56:18.648436"], ["id", 13]]
---
	def update
		@post = Post.find(params[:id])
		if (@post.update(post_params))

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ?  [["id", 10]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "HassanKhanyusufzai"], ["updated_at", "2019-12-09 13:54:45.517388"], ["id", 10]]
---
	def change
		#Vulneralbe
		parameter = params[:id]
		@post = Post.where(id: 10).update_all("title = '#{parameter}'")