app/controllers/sqlitest3_controller.rb

	def sqlitest3
		#Vulneralbe
		parameter = params[:id]
		@post = Post.where(id: 10).update_all("title = '#{parameter}'")
---
UPDATE "posts" SET title = '1'' WHERE "posts"."id" = ?  [["id", 10]]