app/controllers/sqlitest2_controller.rb

SELECT "posts".* FROM "posts" WHERE (id = '')
---
	def sqlitest2
		evil_query = params[:id]
		filter = '\''.match(evil_query).to_s
		@post = Post.where("id = '#{filter}'")