app/controllers/sqlitest_controller.rb

	def sqlitest
		#@post = Post.where("id = '#{params[:id]}'")
		@post = Post.where("id = ?", params[:id])
---
SELECT "posts".* FROM "posts" WHERE (id = '1') AND 9801=(CASE WHEN (4620=                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                4620) THEN (LIKE('ABCDEFG',UPPER(HEX(RANDOMBLOB(500000000/2))))) ELSE 9801 END)-- LXVq')